---
type: AnalysisDisplayColorEntry
namespace: Autodesk.Revit.DB.Analysis
version: 2024
members: 8
tags: [revit-api, class]
---

# AnalysisDisplayColorEntry

`Autodesk.Revit.DB.Analysis.AnalysisDisplayColorEntry` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | AnalysisDisplayColorEntry | — | `` |
| Constructor | AnalysisDisplayColorEntry | 2011 | `public AnalysisDisplayColorEntry ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | HasValue | 2011 | `public bool HasValue ()` |
| Method | IsEqual | 2011 | `public bool IsEqual ( AnalysisDisplayColorEntry other )` |
| Property | Color | 2011 | `public Color Color { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Value | 2011 | `public double Value { get ; }` |